#Exploratory Data Analysis and Cleaning

In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.8/site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/anaconda3/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in /opt/anaconda3/lib/python3.8/site-packages (from pandas) (1.22.4)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.8/site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
WARNING: Error parsing requirements for jupyter: [Errno 2] No such file or directory: '/opt/anaconda3/lib/python3.8/site-packages/jupyter-1.0.0.dist-info/METADATA'
Note: you may need to restart the kernel to use updated packages.

In [12]:

import numpy as np
import pandas as pd

In [3]:
import csv

In [4]:
# To read in data using List 
with open("titanic.csv","r") as f:
    data = list(csv.reader(f,delimiter = ","))

In [5]:
#for row in data:
 #   print(row)

In [6]:
# To read in data using Pandas
 data = pd.read_csv("./titanic.csv")

In [7]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S